-- SQL 파일에서 주석문은 -- 표시하고 해당 내용을 기술합니다.

-- Table : 데이터 베이스에서 사용되는 데이터 집합의 단위.
-- 열 : *Field*, 속성, 애트리뷰트
-- 행 : *Record*, 튜플

-- 위와 같이 표 형식의 데이터베이스를 관계형 데이터베이스라고 부릅니다.

-- 현재 출시되어 데이터베이스로 활용되는 제품들 : 오라클, MySQL, MSSQL, MariaDB,
-- 	MongDB, Accese 등
-- 데이터베이스의 조작 운영을 가능하게 하는 프로그램 : DBMS(Database Management System)
-- 각 데이터베이스 제품들에는 자신의 데이터베이스를 관리할 수 있는 DBMS가 존재합니다.
-- 오라클데이터 베이스에서 사용 가능한 DBMS : SQL Developer, SQL PLUS, 이클립스 등

-- 데이터 베이스의 활용 분야 : 일반 웹사이트 게시판의 게시물 저장용, 포털 검색 사이트 검색 대상 정보
-- 저장용, RPG등 게임의 게임정보 또는 캐릭터 정보, 회원들의 회원정보 등